{"community": "climate", "post": "Hillary Clinton plans to get \"aggressive\" on climate. Here's what that might look like.", "comment": "I'll believe a candidate who has a track record of being on the right side of issues their whole career, not one who is merely saying the right things at the right time to the right people. Hillary's record has been one of siding with giant corporations. Obama said a lot of things to please the ears of progressives during the primaries too. People didn't pay attention when he was supporting telecom immunity (for spying) and Joe Lieberman over a progressive.", "reply": ">I'll believe a candidate who has a track record of being on the right side of issues their whole career... Out of curiosity, which of the most recent presidents / candidates meets your qualifications? Obama, Bush Jr., Clinton, Bush Sr., Reagan?", "label": "0: disagree"}
{"community": "Brexit", "post": "The European Union’s full devastating point-by-point rejection of Boris Johnson’s proposals revealed in documents obtained by the Guardian", "comment": "The only proposal that the EU would not reject would be giving up the Northern Ireland. Of course, they never say it.", "reply": "The EU wouldn't say it because it's not up to them. The whole point of the GFA is that NI has a say in it's own future.", "label": "0: disagree"}
{"community": "Brexit", "post": "Farage is leading us towards revoke and remoaners are leading us towards no deal Forget the tory leadership election for a moment. Farage is currently leading the UK towards brexit being cancelled. Why? Because his party have taken half the tory vote, but because Labour is still triangulating/compromising they have only taken a much a smaller chunk of the Labour vote. There's got to be a general election soon, and as things stand, the Brexit Party would manage to deprive the tories of at least 100 of their seats, but wouldn't actually win many of them (if any). The result [TRUNCATED]", "comment": "Wow, that's one powerful crystal ball you have. Any chance I could borrow it for the powerball numbers?", "reply": ">Wow, that's one powerful crystal ball you have. Any chance I could borrow it for the powerball numbers? The current situation is 4-dimensional chess, not bingo.", "label": "0: disagree"}
{"community": "climate", "post": "The believers. \"Climate alarm belongs to a class of issues characterized by a claim for which there is no evidence, that nonetheless appeals strongly to one or more interests or prejudices. Once the issue is adopted, evidence becomes irrelevant. Instead, the believer sees what he believes.\"   Richard Lindzen,  distinguished senior fellow in the Center for the Study of Science, professor of meteorology at MIT, where he was the Alfred P. Sloan Professor, beginning in 1983. Prior to that he was the Robert P. Burden Professor of Dynamic Meteorology at Harvard University.", "comment": "So now that Lindzen's eye theory has been discarded, what explanation does he actually have for his disbelief in global warming? > In November 2004, climate change skeptic Richard Lindzen was quoted saying he'd be willing to bet that the earth's climate will be cooler in 20 years than it is today. When British climate researcher James Annan contacted him, however, Lindzen would only agree to take the bet if Annan offered a 50-to-1 payout. So Lindzen thinks there's a 98% chance global warming is real... oh dear...", "reply": "So? Even the biggest pushers of AGW don't really believe it. Why would AL GORE buy beachfront property?", "label": "0: disagree"}
{"community": "democrats", "post": "He May Not Be a Candidate, but Beto O’Rourke is Rebuilding His Texas Organizing Machine for 2020", "comment": "He has like $20 million from his Presidential bid, why isn't he running for Senate again?", "reply": "I don't think he can beat Cornyn, and he probably thinks that losing two elections (three, if you're counting his presidential bid) in two years forever kills him politically.", "label": "1: neutral"}
{"community": "Brexit", "post": "DUP thrown under the Brexit Bus As an Irishman there is a certain satisfaction watching the UK destroy its economy but even better to watch the DUP being thrown under the bus. Imagine the UK gov not keeping its promises and selling them out...... never saw that coming ........", "comment": "I think NI should get it's own shit together first by getting the Parliament up and running before bemoaning about anything.", "reply": "wait 2 weeks until Gay marriage and abortion become law, then reconvene - really rub the DUPs face in failure.", "label": "1: neutral"}
{"community": "Brexit", "post": "It is not, nor will it ever be, undemocratic to put an issue to a public vote. Something that has been bugging me over recent months is this particular argument against a second referendum. Full disclosure: I voted remain, but I was not overly devistated when I awoke the day after the vote to discover the public had voted to leave the EU. I thought it was quite possible for us to make a success of Brexit, though I thought success to be unlikely. I believe we know a lot more now than we did when we first voted to [TRUNCATED]", "comment": "'A democracy that cannot change its mind is not a democracy' David Davis, (ex)Brexit Secretary", "reply": "I think the counter to that is that votes have consequences and once the voters have unleashed those consequences it's too late to take them back. I'm on the fence about how much that applies to this situation.", "label": "1: neutral"}
{"community": "Brexit", "post": "Brexit trolling and name-calling I've noticed a sharp increase in the number of posts calling people remoaners, suggesting they are 'butt hurt'. My question for brexiteers, is brexit about improving the UK or upsetting people who have different opinions to yourselves or whose lives have been negatively affected by the UK leaving the EU? If your whole thing is to troll people who will have diminished quality of life, reduced employment prospects, reduced legal protections, as a result of the UK leaving the EU then you are truly a sick individual and I suspect, hate your own life, normal people [TRUNCATED]", "comment": "One recent post asked 'Is the 'Butt-Hurt' strong with you today?' by a brexit redditor with the handle Dex... Normal people are not hell bent on upsetting people who believe they have lost something of significance.", "reply": "Because they have literally no arguments. The Brexiteers I have utmost respect for are those who argue their point because they actually have one. Those Brexiteers don't often resort to 'Remoaner this' and 'Remoaner that'. The number of people who voted Brexit just cause 'LOL SJW TEARS!' is just a very good indication of how sad a lot of the population really is.", "label": "1: neutral"}
{"community": "Brexit", "post": "Michel Barnier calls David Davis to Brexit transition crisis talks | Politics", "comment": "The EU are doing our work for us: they are writing Brexit into law, they provide clarity, they solve the big problems out there. The UK, as usual, \"leads from the back\". This is not what I had imagined as \"taking back control\".", "reply": "> This is not what I had imagined as \"taking back control\". More of \"taking back the back\"...", "label": "2: agree"}
{"community": "Brexit", "post": "Britons may need £52 visa to visit mainland Europe after Brexit", "comment": "That would be a stupid decision. Not the fee itself, but the waiting time. British tourists spend a lot of money on holiday, that's money for the local economy.", "reply": "To be fair, while I agree that 2 weeks is too long - punitive even - most people book their hols more than 2 weeks in advance", "label": "2: agree"}
{"community": "Brexit", "post": "EU says it did not amend Theresa May’s Brexit deal for Boris Johnson and only ‘clarified’ it", "comment": "But the details of the deals are wildly different so someone of the three is lying: 1. May lied about what was in her real withdrawal agreement 2. Boris lied about what is in his withdrawal agreement 3. The EU are lying (And/or mistaken) in their description that this is just a clarificaton Given the track record I'm going to guess Boris lied about something. But I think it's Theresa May in this case.", "reply": "> someone of the three is lying Taking a wild guess here: is it the one with at proven track record of lying?", "label": "2: agree"}
{"community": "climate", "post": "My father does not believe in man-induced climate change. Help me change his opinion. My dad and I have been having an argument over whether man has had any impact on climate change. He believes there is a natural cycle (which I also believe in) and that mankind has had no impact on the speed of climate change, climate change on any level and that mankind can have no influence on the way the climate is changing - in terms of stopping the progression or reducing temperature. He believes the earth is cooling and not warming. Neither of us come [TRUNCATED]", "comment": "You can't make someone believe something that he doesn't want to believe. Most people's views on climate change are ideological - they are a result of what the person believes the role of government should be. You won't find many liberal Democrat climate change deniers. >Neither of us come from a scientific background and he believes that most reports written into it are properganda paid for by NGOs and governments to set targets to make them look Iike they are doing something... This is a baseless conspiracy theory.", "reply": "I said exactly the same about it being a conspiracy. I said I couldn't put any scientific document in front of him without him querying the source! That's why I've come here for some help, as I think those on this site will likely have a better chance of pointing out what is fact vs fiction :)", "label": "2: agree"}