{"id": "q1", "text": "What is the capital city of France?", "answer": "Paris"}
{"id": "q2", "text": "Which planet is known as the Red Planet?", "answer": "Mars"}
{"id": "q3", "text": "What is the chemical symbol for water?", "answer": "H₂O"}
{"id": "q4", "text": "In what year did World War II end?", "answer": "1945"}
{"id": "q5", "text": "Who wrote the play *Romeo and Juliet*?", "answer": "William Shakespeare"}
{"id": "q6", "text": "What is the square root of 144?", "answer": "12"}
{"id": "q7", "text": "What is the largest organ in the human body?", "answer": "The skin"}
{"id": "q8", "text": "Which element has the atomic number 6?", "answer": "Carbon"}
{"id": "q9", "text": "Which country has the most time zones?", "answer": "France"}
{"id": "q10", "text": "What is the derivative of sin(x)?", "answer": "cos(x)"}
{"id": "q11", "text": "Which African nation has Spanish as an official language?", "answer": "Equatorial Guinea"}
{"id": "q12", "text": "Who developed the general theory of relativity?", "answer": "Albert Einstein"}
{"id": "q13", "text": "What number comes next in the sequence: 2, 3, 5, 7, 11, 13, ?", "answer": "17"}
{"id": "q14", "text": "What is the only known metal that is liquid at room temperature?", "answer": "Mercury"}
{"id": "q15", "text": "What is the name of the mathematical object that generalizes the notion of curves and surfaces to higher dimensions, central to differential geometry and general relativity?", "answer": "Manifold"}
{"id": "q16", "text": "Which number is the smallest sociable number greater than 1 (i.e., the smallest number in a cycle of aliquot sums longer than 2)?", "answer": "12496"}
{"id": "q17", "text": "What is the name of the obscure 9th-century manuscript that contains a mix of Latin and Old High German, often cited as one of the earliest examples of code-switching?", "answer": "Hildebrandslied"}
{"id": "q18", "text": "Which 19th-century mathematician proved that there are infinitely many transcendental numbers, but only gave two explicit examples (e and π)?", "answer": "Georg Cantor"}
{"id": "q19", "text": "Which unique chemical element is named after a real continent, not a country, state, or city?", "answer": "Europium"}
{"id": "q20", "text": "What is the name of the lost ancient Greek city described by Strabo and rediscovered in 2001 near the village of Palaiokastro in Thessaly, Greece?", "answer": "Helike"}