{"id": "PR101", "text": "If you blow up a balloon and put it in a freezer for an hour, what will happen to the balloon?", "answer": "The balloon will shrink in size. As the air inside cools, the air molecules slow down and exert less pressure on the balloon walls, causing it to contract.", "diff_level": 2}
{"id": "PR102", "text": "A ship carrying a cargo of steel balls is floating in a swimming pool. If the cargo is thrown overboard into the pool, what happens to the water level in the pool?", "answer": "The water level will drop. When the steel balls are on the ship, they displace water equal to their weight. When in the water, they only displace their volume. Since steel is denser than water, the volume displacement is less than the weight displacement, so the water level falls.", "diff_level": 5}
{"id": "PR103", "text": "If you drop a rubber ball and a steel ball of the same size from the same height, which will bounce higher on a hard floor, and why?", "answer": "The rubber ball will bounce higher because it has a higher coefficient of restitution (elasticity). The rubber ball converts more of its kinetic energy back into motion during the collision with the floor, while the steel ball loses more energy to heat and sound.", "diff_level": 3}
{"id": "PR104", "text": "When you place a straw in a glass of water and cover the top end with your finger completely, then lift the straw out, why does the water stay in the straw?", "answer": "Atmospheric pressure pushing up on the bottom of the water column in the straw is greater than the weight of the water pulling down. With your finger blocking the top, air cannot enter to equalize the pressure, creating a partial vacuum that helps hold the water in place.", "diff_level": 3}
{"id": "PR105", "text": "If you tie a string to a ball and swing it in a circle above your head, then suddenly cut the string, in which direction will the ball fly?", "answer": "The ball will fly off in a straight line tangent to the circle at the point where the string was cut, not outward from the center. This demonstrates Newton's First Law - objects in motion continue in a straight line unless acted upon by an outside force.", "diff_level": 4}
{"id": "PR106", "text": "Why do ice cubes often stick to your fingers when you try to pick them up from a glass of water?", "answer": "The warmth from your fingers melts a thin layer of the ice cube's surface. When you touch the ice, this water refreezes due to the still-frozen core of the ice cube, creating a bond between your skin and the ice.", "diff_level": 2}
{"id": "PR107", "text": "Two identical empty glasses are placed on a table. One is turned upside down. Which glass will collect more dust over the course of a week?", "answer": "The upright glass will collect more dust. Dust particles settle due to gravity, and the upright glass provides an open surface for dust to accumulate. The inverted glass only collects dust on its exterior surface.", "diff_level": 1}
{"id": "PR108", "text": "Why does your voice sound different when you speak after inhaling helium compared to regular air?", "answer": "Helium is less dense than air, so sound waves travel faster through it. This increases the resonant frequencies in your vocal tract without changing the frequency of your vocal cord vibrations. The result is that your voice sounds higher-pitched but with the same fundamental frequency pattern.", "diff_level": 4}
{"id": "PR109", "text": "If you place a steel needle carefully on the surface of water in a glass, it can float despite steel being denser than water. Why?", "answer": "Surface tension creates a slight depression in the water surface that can support the needle. Water molecules at the surface are more strongly attracted to each other than to the air above, creating a 'skin' effect strong enough to support small objects like needles if placed gently.", "diff_level": 5}
{"id": "PR110", "text": "When you shake a can of soda, why does it fizz more when opened?", "answer": "Shaking increases the pressure inside the can and forces carbon dioxide gas to dissolve into the liquid. When the can is opened, this pressure is released, allowing the extra dissolved CO2 to rapidly form bubbles and escape as fizz.", "diff_level": 1}